In [61]:
import numpy as np
import pandas as pd

In [84]:

data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [1, 2, 3, 4, 5],
    'C': [1, 2, 3, np.nan, np.nan],
    'D': [1, np.nan, np.nan, np.nan, 5]
}
#nan = not a number
df = pd.DataFrame(data)

In [85]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [86]:
print(df.isna()) #gives the boolean as of which value in dataframe is nan
print(df.isna().sum()) #gives the count of nan in each column

       A      B      C      D
0  False  False  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False
A    1
B    0
C    2
D    3
dtype: int64

In [87]:
df.isna().any() #returns if a column consists of na

A     True
B    False
C     True
D     True
dtype: bool

Removing missing data

In [88]:
df.dropna() #drops the row with atleast one na

     A  B    C    D
0  1.0  1  1.0  1.0

In [89]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [93]:
df.dropna(thresh=3) #drops row if atleast 3 non null are present in a row

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
4  5.0  5  NaN  5.0

Filling missing data

In [94]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [95]:
df.fillna(0) #not applied, to apply write inplace= true

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  0.0
2  0.0  3  3.0  0.0
3  4.0  4  0.0  0.0
4  5.0  5  0.0  5.0

In [96]:
values = {'A': 0, 'B': 100, 'C': 300, 'D': 400}
df.fillna(value=values) #fill and selection operations are columnwise

     A  B      C      D
0  1.0  1    1.0    1.0
1  2.0  2    2.0  400.0
2  0.0  3    3.0  400.0
3  4.0  4  300.0  400.0
4  5.0  5  300.0    5.0